# mange dependencies with brew https://brew.sh/

brew "ansible"            # ansible vault to be used for encrypting and
                          # decrypting secrets
brew "mkcert"             # make SSL certificate to serve HTTPS content on
                          # localhost
brew "ag"                 # sliver searcher, a faster grep
brew "gnupg"              # needed for gem install
brew "icu4c"              # needed for gem install charlock_holmes -v '0.7.7'
brew "jq"                 # UNIX tool for parsing and querying JSON
brew "kubectl"            # access GCP remote kubernetes pods
brew "wget"               # UNIX tool for fetching things from the nets
brew "tmux"               # terminal multiplexer for automating running many
                          # processes across many windows
tap "heroku/brew"
brew "heroku"             # deploy and manage heroku platform

brew "exercism"           # code learning platform
brew "ffmpeg"             # video processing like making animated gifs
brew "neovim"             # a better vim
brew "netlify-cli"        # deploy and manage netlify platform

cask "google-chrome"      # browser and will be used for automated testing
cask "google-cloud-sdk"   # access GCP
cask "iterm2"             # better terminal supporting tmux native tabs and
                          # command click files/links
cask "slack"              # ad hoc messaging platform
cask "visual-studio-code" # preferred code editor
# cask "zoom"             # video communications platform - needs sudo access
                          # might as well just just manually install

tap "homebrew/cask"
cask "gimp"               # image manipulation program

